una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam7l64.h
/* -------- TCB_BCR : (TCB Offset: 0xc0) TC Block Control Register -------- */
#define AT91C_TCB_SYNC        ((unsigned int) 0x1 <<  0) /* (TCB) Synchro Command*/
/* -------- TCB_BMR : (TCB Offset: 0xc4) TC Block Mode Register -------- */
#define AT91C_TCB_TC0XC0S     ((unsigned int) 0x3 <<  0) /* (TCB) External Clock Signal 0 Selection*/
#define 	AT91C_TCB_TC0XC0S_TCLK0                ((unsigned int) 0x0) /* (TCB) TCLK0 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_NONE                 ((unsigned int) 0x1) /* (TCB) None signal connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA1                ((unsigned int) 0x2) /* (TCB) TIOA1 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA2                ((unsigned int) 0x3) /* (TCB) TIOA2 connected to XC0*/
#define AT91C_TCB_TC1XC1S     ((unsigned int) 0x3 <<  2) /* (TCB) External Clock Signal 1 Selection*/
#define 	AT91C_TCB_TC1XC1S_TCLK1                ((unsigned int) 0x0 <<  2) /* (TCB) TCLK1 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_NONE                 ((unsigned int) 0x1 <<  2) /* (TCB) None signal connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA0                ((unsigned int) 0x2 <<  2) /* (TCB) TIOA0 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA2                ((unsigned int) 0x3 <<  2) /* (TCB) TIOA2 connected to XC1*/
#define AT91C_TCB_TC2XC2S     ((unsigned int) 0x3 <<  4) /* (TCB) External Clock Signal 2 Selection*/
#define 	AT91C_TCB_TC2XC2S_TCLK2                ((unsigned int) 0x0 <<  4) /* (TCB) TCLK2 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_NONE                 ((unsigned int) 0x1 <<  4) /* (TCB) None signal connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA0                ((unsigned int) 0x2 <<  4) /* (TCB) TIOA0 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA1                ((unsigned int) 0x3 <<  4) /* (TCB) TIOA2 connected to XC2*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Segment LCD Controller*/
/* ******************************************************************************/
typedef struct _AT91S_SLCDC {
	AT91_REG	 SLCDC_CR; 	/* Control Register*/
	AT91_REG	 SLCDC_MR; 	/* Mode Register*/
	AT91_REG	 SLCDC_FRR; 	/* Frame Rate Register*/
	AT91_REG	 SLCDC_DR; 	/* Display Register*/
	AT91_REG	 SLCDC_SR; 	/* Status Register*/
	AT91_REG	 Reserved0[3]; 	/* */
	AT91_REG	 SLCDC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SLCDC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SLCDC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SLCDC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 Reserved1[116]; 	/* */
	AT91_REG	 SLCDC_MEM[80]; 	/* Memory Register*/
} AT91S_SLCDC, *AT91PS_SLCDC;

/* -------- SLCDC_CR : (SLCDC Offset: 0x0) SLCDC Control Register -------- */
#define AT91C_SLCDC_LCDEN     ((unsigned int) 0x1 <<  0) /* (SLCDC) Enable the LCDC*/
#define AT91C_SLCDC_LCDDIS    ((unsigned int) 0x1 <<  1) /* (SLCDC) Disable the LCDC*/
#define AT91C_SLCDC_SWRST     ((unsigned int) 0x1 <<  3) /* (SLCDC) Software Reset*/
/* -------- SLCDC_MR : (SLCDC Offset: 0x4) SLCDC Control Register -------- */
#define AT91C_SLCDC_COMSEL    ((unsigned int) 0xF <<  0) /* (SLCDC) Selection of the number of common*/
#define 	AT91C_SLCDC_COMSEL_0                    ((unsigned int) 0x0) /* (SLCDC) COM0 selected*/
#define 	AT91C_SLCDC_COMSEL_1                    ((unsigned int) 0x1) /* (SLCDC) COM1 selected*/
#define 	AT91C_SLCDC_COMSEL_2                    ((unsigned int) 0x2) /* (SLCDC) COM2 selected*/
#define 	AT91C_SLCDC_COMSEL_3                    ((unsigned int) 0x3) /* (SLCDC) COM3 selected*/
#define 	AT91C_SLCDC_COMSEL_4                    ((unsigned int) 0x4) /* (SLCDC) COM4 selected*/
#define 	AT91C_SLCDC_COMSEL_5                    ((unsigned int) 0x5) /* (SLCDC) COM5 selected*/
#define 	AT91C_SLCDC_COMSEL_6                    ((unsigned int) 0x6) /* (SLCDC) COM6 selected*/
#define 	AT91C_SLCDC_COMSEL_7                    ((unsigned int) 0x7) /* (SLCDC) COM7 selected*/
#define 	AT91C_SLCDC_COMSEL_8                    ((unsigned int) 0x8) /* (SLCDC) COM8 selected*/
#define 	AT91C_SLCDC_COMSEL_9                    ((unsigned int) 0x9) /* (SLCDC) COM9 selected*/
#define AT91C_SLCDC_SEGSEL    ((unsigned int) 0x1F <<  8) /* (SLCDC) Selection of the number of segment*/
#define AT91C_SLCDC_BUFTIME   ((unsigned int) 0xF << 16) /* (SLCDC) Buffer on time*/
#define 	AT91C_SLCDC_BUFTIME_0_percent            ((unsigned int) 0x0 << 16) /* (SLCDC) Buffer aren't driven*/
#define 	AT91C_SLCDC_BUFTIME_2_Tsclk              ((unsigned int) 0x1 << 16) /* (SLCDC) Buffer are driven during 2 SLCDC clock periods*/
#define 	AT91C_SLCDC_BUFTIME_4_Tsclk              ((unsigned int) 0x2 << 16) /* (SLCDC) Buffer are driven during 4 SLCDC clock periods*/
#define 	AT91C_SLCDC_BUFTIME_8_Tsclk              ((unsigned int) 0x3 << 16) /* (SLCDC) Buffer are driven during 8 SLCDC clock periods*/
#define 	AT91C_SLCDC_BUFTIME_16_Tsclk             ((unsigned int) 0x4 << 16) /* (SLCDC) Buffer are driven during 16 SLCDC clock periods*/
#define 	AT91C_SLCDC_BUFTIME_32_Tsclk             ((unsigned int) 0x5 << 16) /* (SLCDC) Buffer are driven during 32 SLCDC clock periods*/
#define 	AT91C_SLCDC_BUFTIME_64_Tsclk             ((unsigned int) 0x6 << 16) /* (SLCDC) Buffer are driven during 64 SLCDC clock periods*/
#define 	AT91C_SLCDC_BUFTIME_128_Tsclk            ((unsigned int) 0x7 << 16) /* (SLCDC) Buffer are driven during 128 SLCDC clock periods*/
#define 	AT91C_SLCDC_BUFTIME_50_percent           ((unsigned int) 0x8 << 16) /* (SLCDC) Buffer are driven during 50 percent of the frame*/
#define 	AT91C_SLCDC_BUFTIME_100_percent          ((unsigned int) 0x9 << 16) /* (SLCDC) Buffer are driven during 100 percent of the frame*/
#define AT91C_SLCDC_BIAS      ((unsigned int) 0x3 << 20) /* (SLCDC) Bias setting*/
#define 	AT91C_SLCDC_BIAS_1                    ((unsigned int) 0x0 << 20) /* (SLCDC) Vbias is VDD */
#define 	AT91C_SLCDC_BIAS_1_2                  ((unsigned int) 0x1 << 20) /* (SLCDC) Vbias is 1/2 VDD*/
#define 	AT91C_SLCDC_BIAS_1_3                  ((unsigned int) 0x2 << 20) /* (SLCDC) Vbias is 1/3 VDD*/
#define 	AT91C_SLCDC_BIAS_1_4                  ((unsigned int) 0x3 << 20) /* (SLCDC) Vbias is 1/4 VDD*/
#define AT91C_SLCDC_LPMODE    ((unsigned int) 0x1 << 24) /* (SLCDC) Low Power mode*/
/* -------- SLCDC_FRR : (SLCDC Offset: 0x8) SLCDC Frame Rate Register -------- */
#define AT91C_SLCDC_PRESC     ((unsigned int) 0x7 <<  0) /* (SLCDC) Clock prescaler*/
#define 	AT91C_SLCDC_PRESC_SCLK_8               ((unsigned int) 0x0) /* (SLCDC) Clock Prescaler is 8*/
#define 	AT91C_SLCDC_PRESC_SCLK_16              ((unsigned int) 0x1) /* (SLCDC) Clock Prescaler is 16*/
#define 	AT91C_SLCDC_PRESC_SCLK_32              ((unsigned int) 0x2) /* (SLCDC) Clock Prescaler is 32*/
#define 	AT91C_SLCDC_PRESC_SCLK_64              ((unsigned int) 0x3) /* (SLCDC) Clock Prescaler is 64*/
#define 	AT91C_SLCDC_PRESC_SCLK_128             ((unsigned int) 0x4) /* (SLCDC) Clock Prescaler is 128*/
#define 	AT91C_SLCDC_PRESC_SCLK_256             ((unsigned int) 0x5) /* (SLCDC) Clock Prescaler is 256*/
#define 	AT91C_SLCDC_PRESC_SCLK_512             ((unsigned int) 0x6) /* (SLCDC) Clock Prescaler is 512*/
#define 	AT91C_SLCDC_PRESC_SCLK_1024            ((unsigned int) 0x7) /* (SLCDC) Clock Prescaler is 1024*/
#define AT91C_SLCDC_DIV       ((unsigned int) 0x7 <<  8) /* (SLCDC) Clock division*/
#define 	AT91C_SLCDC_DIV_1                    ((unsigned int) 0x0 <<  8) /* (SLCDC) Clock division is 1*/
#define 	AT91C_SLCDC_DIV_2                    ((unsigned int) 0x1 <<  8) /* (SLCDC) Clock division is 2*/
#define 	AT91C_SLCDC_DIV_3                    ((unsigned int) 0x2 <<  8) /* (SLCDC) Clock division is 3*/
#define 	AT91C_SLCDC_DIV_4                    ((unsigned int) 0x3 <<  8) /* (SLCDC) Clock division is 4*/
#define 	AT91C_SLCDC_DIV_5                    ((unsigned int) 0x4 <<  8) /* (SLCDC) Clock division is 5*/
#define 	AT91C_SLCDC_DIV_6                    ((unsigned int) 0x5 <<  8) /* (SLCDC) Clock division is 6*/
#define 	AT91C_SLCDC_DIV_7                    ((unsigned int) 0x6 <<  8) /* (SLCDC) Clock division is 7*/
#define 	AT91C_SLCDC_DIV_8                    ((unsigned int) 0x7 <<  8) /* (SLCDC) Clock division is 8*/
/* -------- SLCDC_DR : (SLCDC Offset: 0xc) SLCDC Display Register -------- */
#define AT91C_SLCDC_DISPMODE  ((unsigned int) 0x7 <<  0) /* (SLCDC) Display mode*/
#define 	AT91C_SLCDC_DISPMODE_NORMAL               ((unsigned int) 0x0) /* (SLCDC) Latched datas are displayed*/
#define 	AT91C_SLCDC_DISPMODE_FORCE_OFF            ((unsigned int) 0x1) /* (SLCDC) All pixel are unvisible*/
#define 	AT91C_SLCDC_DISPMODE_FORCE_ON             ((unsigned int) 0x2) /* (SLCDC) All pixel are visible*/
#define 	AT91C_SLCDC_DISPMODE_BLINK                ((unsigned int) 0x3) /* (SLCDC) Turn all pixel alternatively off to the state defined in SCLD memory at LCDBLKFREQ frequency*/
#define 	AT91C_SLCDC_DISPMODE_INVERTED             ((unsigned int) 0x4) /* (SLCDC) All pixel are set in the inverted state as defined in SCLD memory*/
#define 	AT91C_SLCDC_DISPMODE_INVERTED_BLINK       ((unsigned int) 0x5) /* (SLCDC) Turn all pixel alternatively off to the opposite state defined in SCLD memory at LCDBLKFREQ frequency*/
/* -------- SLCDC_SR : (SLCDC Offset: 0x10) SLCDC Status  Register -------- */
#define AT91C_SLCDC_ENA       ((unsigned int) 0x1 <<  0) /* (SLCDC) Enable status*/
/* -------- SLCDC_IER : (SLCDC Offset: 0x20) SLCDC Interrupt Enable Register -------- */
#define AT91C_SLCDC_ENDFRAME  ((unsigned int) 0x1 <<  0) /* (SLCDC) End of Frame*/
#define AT91C_SLCDC_BKPER     ((unsigned int) 0x1 <<  1) /* (SLCDC) Blank Periode*/
#define AT91C_SLCDC_DIS       ((unsigned int) 0x1 <<  2) /* (SLCDC) Disable*/
/* -------- SLCDC_IDR : (SLCDC Offset: 0x24) SLCDC Interrupt Disable Register -------- */
/* -------- SLCDC_IMR : (SLCDC Offset: 0x28) SLCDC Interrupt Mask Register -------- */
/* -------- SLCDC_ISR : (SLCDC Offset: 0x2c) SLCDC Interrupt Status Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Analog to Digital Convertor*/
/* ******************************************************************************/
typedef struct _AT91S_ADC {
	AT91_REG	 ADC_CR; 	/* ADC Control Register*/
	AT91_REG	 ADC_MR; 	/* ADC Mode Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 ADC_CHER; 	/* ADC Channel Enable Register*/
	AT91_REG	 ADC_CHDR; 	/* ADC Channel Disable Register*/
	AT91_REG	 ADC_CHSR; 	/* ADC Channel Status Register*/
	AT91_REG	 ADC_SR; 	/* ADC Status Register*/
	AT91_REG	 ADC_LCDR; 	/* ADC Last Converted Data Register*/
	AT91_REG	 ADC_IER; 	/* ADC Interrupt Enable Register*/
	AT91_REG	 ADC_IDR; 	/* ADC Interrupt Disable Register*/
	AT91_REG	 ADC_IMR; 	/* ADC Interrupt Mask Register*/
	AT91_REG	 ADC_CDR0; 	/* ADC Channel Data Register 0*/
	AT91_REG	 ADC_CDR1; 	/* ADC Channel Data Register 1*/
	AT91_REG	 ADC_CDR2; 	/* ADC Channel Data Register 2*/
	AT91_REG	 ADC_CDR3; 	/* ADC Channel Data Register 3*/
	AT91_REG	 ADC_CDR4; 	/* ADC Channel Data Register 4*/
	AT91_REG	 ADC_CDR5; 	/* ADC Channel Data Register 5*/
	AT91_REG	 ADC_CDR6; 	/* ADC Channel Data Register 6*/
	AT91_REG	 ADC_CDR7; 	/* ADC Channel Data Register 7*/
	AT91_REG	 Reserved1[44]; 	/* */
	AT91_REG	 ADC_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 ADC_RCR; 	/* Receive Counter Register*/
	AT91_REG	 ADC_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 ADC_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 ADC_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 ADC_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 ADC_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 ADC_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 ADC_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 ADC_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_ADC, *AT91PS_ADC;

/* -------- ADC_CR : (ADC Offset: 0x0) ADC Control Register -------- */
#define AT91C_ADC_SWRST       ((unsigned int) 0x1 <<  0) /* (ADC) Software Reset*/
#define AT91C_ADC_START       ((unsigned int) 0x1 <<  1) /* (ADC) Start Conversion*/
/* -------- ADC_MR : (ADC Offset: 0x4) ADC Mode Register -------- */
#define AT91C_ADC_TRGEN       ((unsigned int) 0x1 <<  0) /* (ADC) Trigger Enable*/
#define 	AT91C_ADC_TRGEN_DIS                  ((unsigned int) 0x0) /* (ADC) Hradware triggers are disabled. Starting a conversion is only possible by software*/
#define 	AT91C_ADC_TRGEN_EN                   ((unsigned int) 0x1) /* (ADC) Hardware trigger selected by TRGSEL field is enabled.*/
#define AT91C_ADC_TRGSEL      ((unsigned int) 0x7 <<  1) /* (ADC) Trigger Selection*/
#define 	AT91C_ADC_TRGSEL_TIOA0                ((unsigned int) 0x0 <<  1) /* (ADC) Selected TRGSEL = TIAO0*/
#define 	AT91C_ADC_TRGSEL_TIOA1                ((unsigned int) 0x1 <<  1) /* (ADC) Selected TRGSEL = TIAO1*/
#define 	AT91C_ADC_TRGSEL_TIOA2                ((unsigned int) 0x2 <<  1) /* (ADC) Selected TRGSEL = TIAO2*/
#define 	AT91C_ADC_TRGSEL_TIOA3                ((unsigned int) 0x3 <<  1) /* (ADC) Selected TRGSEL = TIAO3*/
#define 	AT91C_ADC_TRGSEL_TIOA4                ((unsigned int) 0x4 <<  1) /* (ADC) Selected TRGSEL = TIAO4*/
#define 	AT91C_ADC_TRGSEL_TIOA5                ((unsigned int) 0x5 <<  1) /* (ADC) Selected TRGSEL = TIAO5*/
#define 	AT91C_ADC_TRGSEL_EXT                  ((unsigned int) 0x6 <<  1) /* (ADC) Selected TRGSEL = External Trigger*/
#define AT91C_ADC_LOWRES      ((unsigned int) 0x1 <<  4) /* (ADC) Resolution.*/
#define 	AT91C_ADC_LOWRES_10_BIT               ((unsigned int) 0x0 <<  4) /* (ADC) 10-bit resolution*/
#define 	AT91C_ADC_LOWRES_8_BIT                ((unsigned int) 0x1 <<  4) /* (ADC) 8-bit resolution*/
#define AT91C_ADC_SLEEP       ((unsigned int) 0x1 <<  5) /* (ADC) Sleep Mode*/
#define 	AT91C_ADC_SLEEP_NORMAL_MODE          ((unsigned int) 0x0 <<  5) /* (ADC) Normal Mode*/
#define 	AT91C_ADC_SLEEP_MODE                 ((unsigned int) 0x1 <<  5) /* (ADC) Sleep Mode*/
#define AT91C_ADC_PRESCAL     ((unsigned int) 0x3F <<  8) /* (ADC) Prescaler rate selection*/
#define AT91C_ADC_STARTUP     ((unsigned int) 0x1F << 16) /* (ADC) Startup Time*/
#define AT91C_ADC_SHTIM       ((unsigned int) 0xF << 24) /* (ADC) Sample & Hold Time*/
/* -------- 	ADC_CHER : (ADC Offset: 0x10) ADC Channel Enable Register -------- */
#define AT91C_ADC_CH0         ((unsigned int) 0x1 <<  0) /* (ADC) Channel 0*/
#define AT91C_ADC_CH1         ((unsigned int) 0x1 <<  1) /* (ADC) Channel 1*/
#define AT91C_ADC_CH2         ((unsigned int) 0x1 <<  2) /* (ADC) Channel 2*/
#define AT91C_ADC_CH3         ((unsigned int) 0x1 <<  3) /* (ADC) Channel 3*/
#define AT91C_ADC_CH4         ((unsigned int) 0x1 <<  4) /* (ADC) Channel 4*/
#define AT91C_ADC_CH5         ((unsigned int) 0x1 <<  5) /* (ADC) Channel 5*/
#define AT91C_ADC_CH6         ((unsigned int) 0x1 <<  6) /* (ADC) Channel 6*/
#define AT91C_ADC_CH7         ((unsigned int) 0x1 <<  7) /* (ADC) Channel 7*/
/* -------- 	ADC_CHDR : (ADC Offset: 0x14) ADC Channel Disable Register -------- */
/* -------- 	ADC_CHSR : (ADC Offset: 0x18) ADC Channel Status Register -------- */
/* -------- ADC_SR : (ADC Offset: 0x1c) ADC Status Register -------- */
#define AT91C_ADC_EOC0        ((unsigned int) 0x1 <<  0) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC1        ((unsigned int) 0x1 <<  1) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC2        ((unsigned int) 0x1 <<  2) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC3        ((unsigned int) 0x1 <<  3) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC4        ((unsigned int) 0x1 <<  4) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC5        ((unsigned int) 0x1 <<  5) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC6        ((unsigned int) 0x1 <<  6) /* (ADC) End of Conversion*/
#define AT91C_ADC_EOC7        ((unsigned int) 0x1 <<  7) /* (ADC) End of Conversion*/
#define AT91C_ADC_OVRE0       ((unsigned int) 0x1 <<  8) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE1       ((unsigned int) 0x1 <<  9) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE2       ((unsigned int) 0x1 << 10) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE3       ((unsigned int) 0x1 << 11) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE4       ((unsigned int) 0x1 << 12) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE5       ((unsigned int) 0x1 << 13) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE6       ((unsigned int) 0x1 << 14) /* (ADC) Overrun Error*/
#define AT91C_ADC_OVRE7       ((unsigned int) 0x1 << 15) /* (ADC) Overrun Error*/
#define AT91C_ADC_DRDY        ((unsigned int) 0x1 << 16) /* (ADC) Data Ready*/
#define AT91C_ADC_GOVRE       ((unsigned int) 0x1 << 17) /* (ADC) General Overrun*/
#define AT91C_ADC_ENDRX       ((unsigned int) 0x1 << 18) /* (ADC) End of Receiver Transfer*/
#define AT91C_ADC_RXBUFF      ((unsigned int) 0x1 << 19) /* (ADC) RXBUFF Interrupt*/
/* -------- ADC_LCDR : (ADC Offset: 0x20) ADC Last Converted Data Register -------- */
#define AT91C_ADC_LDATA       ((unsigned int) 0x3FF <<  0) /* (ADC) Last Data Converted*/
/* -------- ADC_IER : (ADC Offset: 0x24) ADC Interrupt Enable Register -------- */
/* -------- ADC_IDR : (ADC Offset: 0x28) ADC Interrupt Disable Register -------- */
/* -------- ADC_IMR : (ADC Offset: 0x2c) ADC Interrupt Mask Register -------- */
/* -------- ADC_CDR0 : (ADC Offset: 0x30) ADC Channel Data Register 0 -------- */
#define AT91C_ADC_DATA        ((unsigned int) 0x3FF <<  0) /* (ADC) Converted Data*/
/* -------- ADC_CDR1 : (ADC Offset: 0x34) ADC Channel Data Register 1 -------- */
/* -------- ADC_CDR2 : (ADC Offset: 0x38) ADC Channel Data Register 2 -------- */
/* -------- ADC_CDR3 : (ADC Offset: 0x3c) ADC Channel Data Register 3 -------- */
/* -------- ADC_CDR4 : (ADC Offset: 0x40) ADC Channel Data Register 4 -------- */
/* -------- ADC_CDR5 : (ADC Offset: 0x44) ADC Channel Data Register 5 -------- */
/* -------- ADC_CDR6 : (ADC Offset: 0x48) ADC Channel Data Register 6 -------- */
/* -------- ADC_CDR7 : (ADC Offset: 0x4c) ADC Channel Data Register 7 -------- */

