una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam7l64.h
/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91SAM7L64*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_NPCS3    ((unsigned int) AT91C_PIO_PB12) /*  */
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_NPCS2    ((unsigned int) AT91C_PIO_PB13) /*  */
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_NPCS1    ((unsigned int) AT91C_PIO_PB14) /*  */
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_RTS1     ((unsigned int) AT91C_PIO_PB15) /*  */
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_RTS0     ((unsigned int) AT91C_PIO_PB16) /*  */
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_DTR1     ((unsigned int) AT91C_PIO_PB17) /*  */
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_PWM0     ((unsigned int) AT91C_PIO_PB18) /*  */
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PB19_PWM1     ((unsigned int) AT91C_PIO_PB19) /*  */
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PB20_PWM2     ((unsigned int) AT91C_PIO_PB20) /*  */
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PB21_PWM3     ((unsigned int) AT91C_PIO_PB21) /*  */
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PB22_RXD1     ((unsigned int) AT91C_PIO_PB22) /*  */
#define AT91C_PB22_PCK1     ((unsigned int) AT91C_PIO_PB22) /*  */
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PB23_TXD1     ((unsigned int) AT91C_PIO_PB23) /*  */
#define AT91C_PB23_NPCS3    ((unsigned int) AT91C_PIO_PB23) /*  */
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_SCK1     ((unsigned int) AT91C_PIO_PB24) /*  */
#define AT91C_PB24_PWM0     ((unsigned int) AT91C_PIO_PB24) /*  */
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PB25_RTS1     ((unsigned int) AT91C_PIO_PB25) /*  */
#define AT91C_PB25_PWM1     ((unsigned int) AT91C_PIO_PB25) /*  */
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PIO_PC0        ((unsigned int) 1 <<  0) /* Pin Controlled by PC0*/
#define AT91C_PC0_CTS1     ((unsigned int) AT91C_PIO_PC0) /*  */
#define AT91C_PC0_PWM2     ((unsigned int) AT91C_PIO_PC0) /*  */
#define AT91C_PIO_PC1        ((unsigned int) 1 <<  1) /* Pin Controlled by PC1*/
#define AT91C_PC1_DCD1     ((unsigned int) AT91C_PIO_PC1) /*  */
#define AT91C_PC1_TIOA2    ((unsigned int) AT91C_PIO_PC1) /*  */
#define AT91C_PIO_PC10       ((unsigned int) 1 << 10) /* Pin Controlled by PC10*/
#define AT91C_PC10_TWD      ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PC10_NPCS3    ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PIO_PC11       ((unsigned int) 1 << 11) /* Pin Controlled by PC11*/
#define AT91C_PC11_TWCK     ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PC11_TCLK0    ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PIO_PC12       ((unsigned int) 1 << 12) /* Pin Controlled by PC12*/
#define AT91C_PC12_RXD0     ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PC12_NPCS3    ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PIO_PC13       ((unsigned int) 1 << 13) /* Pin Controlled by PC13*/
#define AT91C_PC13_TXD0     ((unsigned int) AT91C_PIO_PC13) /*  */
#define AT91C_PC13_PCK0     ((unsigned int) AT91C_PIO_PC13) /*  */
#define AT91C_PIO_PC14       ((unsigned int) 1 << 14) /* Pin Controlled by PC14*/
#define AT91C_PC14_RTS0     ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PC14_PWM3     ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PIO_PC15       ((unsigned int) 1 << 15) /* Pin Controlled by PC15*/
#define AT91C_PC15_CTS0     ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PC15_ADTRG    ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PIO_PC16       ((unsigned int) 1 << 16) /* Pin Controlled by PC16*/
#define AT91C_PC16_DRXD     ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PC16_NPCS1    ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PIO_PC17       ((unsigned int) 1 << 17) /* Pin Controlled by PC17*/
#define AT91C_PC17_DTXD     ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PC17_NPCS2    ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PIO_PC18       ((unsigned int) 1 << 18) /* Pin Controlled by PC18*/
#define AT91C_PC18_NPCS0    ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PC18_PWM0     ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PIO_PC19       ((unsigned int) 1 << 19) /* Pin Controlled by PC19*/
#define AT91C_PC19_MISO     ((unsigned int) AT91C_PIO_PC19) /*  */
#define AT91C_PC19_PWM1     ((unsigned int) AT91C_PIO_PC19) /*  */
#define AT91C_PIO_PC2        ((unsigned int) 1 <<  2) /* Pin Controlled by PC2*/
#define AT91C_PC2_DTR1     ((unsigned int) AT91C_PIO_PC2) /*  */
#define AT91C_PC2_TIOB2    ((unsigned int) AT91C_PIO_PC2) /*  */
#define AT91C_PIO_PC20       ((unsigned int) 1 << 20) /* Pin Controlled by PC20*/
#define AT91C_PC20_MOSI     ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PC20_PWM2     ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PIO_PC21       ((unsigned int) 1 << 21) /* Pin Controlled by PC21*/
#define AT91C_PC21_SPCK     ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PC21_PWM3     ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PIO_PC22       ((unsigned int) 1 << 22) /* Pin Controlled by PC22*/
#define AT91C_PC22_TF       ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PC22_TIOA1    ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PIO_PC23       ((unsigned int) 1 << 23) /* Pin Controlled by PC23*/
#define AT91C_PC23_TK       ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PC23_TIOB1    ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PIO_PC24       ((unsigned int) 1 << 24) /* Pin Controlled by PC24*/
#define AT91C_PC24_TD       ((unsigned int) AT91C_PIO_PC24) /*  */
#define AT91C_PC24_PCK1     ((unsigned int) AT91C_PIO_PC24) /*  */
#define AT91C_PIO_PC25       ((unsigned int) 1 << 25) /* Pin Controlled by PC25*/
#define AT91C_PC25_RD       ((unsigned int) AT91C_PIO_PC25) /*  */
#define AT91C_PC25_PCK2     ((unsigned int) AT91C_PIO_PC25) /*  */
#define AT91C_PIO_PC26       ((unsigned int) 1 << 26) /* Pin Controlled by PC26*/
#define AT91C_PC26_RK       ((unsigned int) AT91C_PIO_PC26) /*  */
#define AT91C_PC26_FIQ      ((unsigned int) AT91C_PIO_PC26) /*  */
#define AT91C_PIO_PC27       ((unsigned int) 1 << 27) /* Pin Controlled by PC27*/
#define AT91C_PC27_RF       ((unsigned int) AT91C_PIO_PC27) /*  */
#define AT91C_PC27_IRQ0     ((unsigned int) AT91C_PIO_PC27) /*  */
#define AT91C_PIO_PC3        ((unsigned int) 1 <<  3) /* Pin Controlled by PC3*/
#define AT91C_PC3_DSR1     ((unsigned int) AT91C_PIO_PC3) /*  */
#define AT91C_PC3_TCLK1    ((unsigned int) AT91C_PIO_PC3) /*  */
#define AT91C_PIO_PC4        ((unsigned int) 1 <<  4) /* Pin Controlled by PC4*/
#define AT91C_PC4_RI1      ((unsigned int) AT91C_PIO_PC4) /*  */
#define AT91C_PC4_TCLK2    ((unsigned int) AT91C_PIO_PC4) /*  */
#define AT91C_PIO_PC5        ((unsigned int) 1 <<  5) /* Pin Controlled by PC5*/
#define AT91C_PC5_IRQ1     ((unsigned int) AT91C_PIO_PC5) /*  */
#define AT91C_PC5_NPCS2    ((unsigned int) AT91C_PIO_PC5) /*  */
#define AT91C_PIO_PC6        ((unsigned int) 1 <<  6) /* Pin Controlled by PC6*/
#define AT91C_PC6_NPCS1    ((unsigned int) AT91C_PIO_PC6) /*  */
#define AT91C_PC6_PCK2     ((unsigned int) AT91C_PIO_PC6) /*  */
#define AT91C_PIO_PC7        ((unsigned int) 1 <<  7) /* Pin Controlled by PC7*/
#define AT91C_PC7_PWM0     ((unsigned int) AT91C_PIO_PC7) /*  */
#define AT91C_PC7_TIOA0    ((unsigned int) AT91C_PIO_PC7) /*  */
#define AT91C_PIO_PC8        ((unsigned int) 1 <<  8) /* Pin Controlled by PC8*/
#define AT91C_PC8_PWM1     ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PC8_TIOB0    ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PIO_PC9        ((unsigned int) 1 <<  9) /* Pin Controlled by PC9*/
#define AT91C_PC9_PWM2     ((unsigned int) AT91C_PIO_PC9) /*  */
#define AT91C_PC9_SCK0     ((unsigned int) AT91C_PIO_PC9) /*  */

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM7L64*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Peripheral*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_PIOC   ((unsigned int)  4) /* Parallel IO Controller C*/
#define AT91C_ID_SPI    ((unsigned int)  5) /* Serial Peripheral Interface 0*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_SSC    ((unsigned int)  8) /* Serial Synchronous Controller*/
#define AT91C_ID_TWI    ((unsigned int)  9) /* Two-Wire Interface*/
#define AT91C_ID_PWMC   ((unsigned int) 10) /* PWM Controller*/
#define AT91C_ID_SLCD   ((unsigned int) 11) /* Segmented LCD Controller*/
#define AT91C_ID_TC0    ((unsigned int) 12) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 13) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 14) /* Timer Counter 2*/
#define AT91C_ID_ADC    ((unsigned int) 15) /* Analog-to-Digital Converter*/
#define AT91C_ID_16_Reserved ((unsigned int) 16) /* Reserved*/
#define AT91C_ID_17_Reserved ((unsigned int) 17) /* Reserved*/
#define AT91C_ID_18_Reserved ((unsigned int) 18) /* Reserved*/
#define AT91C_ID_19_Reserved ((unsigned int) 19) /* Reserved*/
#define AT91C_ID_20_Reserved ((unsigned int) 20) /* Reserved*/
#define AT91C_ID_21_Reserved ((unsigned int) 21) /* Reserved*/
#define AT91C_ID_22_Reserved ((unsigned int) 22) /* Reserved*/
#define AT91C_ID_23_Reserved ((unsigned int) 23) /* Reserved*/
#define AT91C_ID_24_Reserved ((unsigned int) 24) /* Reserved*/
#define AT91C_ID_25_Reserved ((unsigned int) 25) /* Reserved*/
#define AT91C_ID_26_Reserved ((unsigned int) 26) /* Reserved*/
#define AT91C_ID_27_Reserved ((unsigned int) 27) /* Reserved*/
#define AT91C_ID_28_Reserved ((unsigned int) 28) /* Reserved*/
#define AT91C_ID_IRQ0   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ALL_INT   ((unsigned int) 0xC000FFFF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM7L64*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) /* (SYS) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0xFFFFF800) /* (PIOC) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_VREG      ((AT91PS_VREG) 	0xFFFFFD60) /* (VREG) Base Address*/
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) /* (MC) Base Address*/
#define AT91C_BASE_PDC_SPI   ((AT91PS_PDC) 	0xFFFE0100) /* (PDC_SPI) Base Address*/
#define AT91C_BASE_SPI       ((AT91PS_SPI) 	0xFFFE0000) /* (SPI) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_SSC   ((AT91PS_PDC) 	0xFFFD4100) /* (PDC_SSC) Base Address*/
#define AT91C_BASE_SSC       ((AT91PS_SSC) 	0xFFFD4000) /* (SSC) Base Address*/
#define AT91C_BASE_PDC_TWI   ((AT91PS_PDC) 	0xFFFB8100) /* (PDC_TWI) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) /* (TWI) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFCC260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFCC240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFCC220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFCC200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFCC000) /* (PWMC) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TCB       ((AT91PS_TCB) 	0xFFFA0000) /* (TCB) Base Address*/
#define AT91C_BASE_SLCDC     ((AT91PS_SLCDC) 	0xFFFB0000) /* (SLCDC) Base Address*/
#define AT91C_BASE_PDC_ADC   ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_ADC) Base Address*/
#define AT91C_BASE_ADC       ((AT91PS_ADC) 	0xFFFD8000) /* (ADC) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM7L64*/
/* ******************************************************************************/
/* ISRAM*/
#define AT91C_ISRAM	 ((char *) 	0x00200000) /* Internal SRAM base address*/
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00002000) /* Internal SRAM size in byte (8 Kbytes)*/
/* IFLASH*/
#define AT91C_IFLASH	 ((char *) 	0x00100000) /* Internal FLASH base address*/
#define AT91C_IFLASH_SIZE	 ((unsigned int) 0x00008000) /* Internal FLASH size in byte (32 Kbytes)*/
#define AT91C_IFLASH_PAGE_SIZE	 ((unsigned int) 128) /* Internal FLASH Page Size: 128 bytes*/
#define AT91C_IFLASH_LOCK_REGION_SIZE	 ((unsigned int) 4096) /* Internal FLASH Lock Region Size: 4 Kbytes*/
#define AT91C_IFLASH_NB_OF_PAGES	 ((unsigned int) 256) /* Internal FLASH Number of Pages: 256 bytes*/
#define AT91C_IFLASH_NB_OF_LOCK_BITS	 ((unsigned int) 8) /* Internal FLASH Number of Lock Bits: 8 bytes*/
#endif /* __IAR_SYSTEMS_ICC__ */

