una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam7l64.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Timer Counter Interface*/
/* - ******************************************************************************/
/* - -------- TCB_BCR : (TCB Offset: 0xc0) TC Block Control Register -------- */
AT91C_TCB_SYNC            EQU (0x1 <<  0) ;- (TCB) Synchro Command
/* - -------- TCB_BMR : (TCB Offset: 0xc4) TC Block Mode Register -------- */
AT91C_TCB_TC0XC0S         EQU (0x3 <<  0) ;- (TCB) External Clock Signal 0 Selection
AT91C_TCB_TC0XC0S_TCLK0   EQU (0x0) ;- (TCB) TCLK0 connected to XC0
AT91C_TCB_TC0XC0S_NONE    EQU (0x1) ;- (TCB) None signal connected to XC0
AT91C_TCB_TC0XC0S_TIOA1   EQU (0x2) ;- (TCB) TIOA1 connected to XC0
AT91C_TCB_TC0XC0S_TIOA2   EQU (0x3) ;- (TCB) TIOA2 connected to XC0
AT91C_TCB_TC1XC1S         EQU (0x3 <<  2) ;- (TCB) External Clock Signal 1 Selection
AT91C_TCB_TC1XC1S_TCLK1   EQU (0x0 <<  2) ;- (TCB) TCLK1 connected to XC1
AT91C_TCB_TC1XC1S_NONE    EQU (0x1 <<  2) ;- (TCB) None signal connected to XC1
AT91C_TCB_TC1XC1S_TIOA0   EQU (0x2 <<  2) ;- (TCB) TIOA0 connected to XC1
AT91C_TCB_TC1XC1S_TIOA2   EQU (0x3 <<  2) ;- (TCB) TIOA2 connected to XC1
AT91C_TCB_TC2XC2S         EQU (0x3 <<  4) ;- (TCB) External Clock Signal 2 Selection
AT91C_TCB_TC2XC2S_TCLK2   EQU (0x0 <<  4) ;- (TCB) TCLK2 connected to XC2
AT91C_TCB_TC2XC2S_NONE    EQU (0x1 <<  4) ;- (TCB) None signal connected to XC2
AT91C_TCB_TC2XC2S_TIOA0   EQU (0x2 <<  4) ;- (TCB) TIOA0 connected to XC2
AT91C_TCB_TC2XC2S_TIOA1   EQU (0x3 <<  4) ;- (TCB) TIOA2 connected to XC2

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Segment LCD Controller*/
/* - ******************************************************************************/
/* - -------- SLCDC_CR : (SLCDC Offset: 0x0) SLCDC Control Register -------- */
AT91C_SLCDC_LCDEN         EQU (0x1 <<  0) ;- (SLCDC) Enable the LCDC
AT91C_SLCDC_LCDDIS        EQU (0x1 <<  1) ;- (SLCDC) Disable the LCDC
AT91C_SLCDC_SWRST         EQU (0x1 <<  3) ;- (SLCDC) Software Reset
/* - -------- SLCDC_MR : (SLCDC Offset: 0x4) SLCDC Control Register -------- */
AT91C_SLCDC_COMSEL        EQU (0xF <<  0) ;- (SLCDC) Selection of the number of common
AT91C_SLCDC_COMSEL_0      EQU (0x0) ;- (SLCDC) COM0 selected
AT91C_SLCDC_COMSEL_1      EQU (0x1) ;- (SLCDC) COM1 selected
AT91C_SLCDC_COMSEL_2      EQU (0x2) ;- (SLCDC) COM2 selected
AT91C_SLCDC_COMSEL_3      EQU (0x3) ;- (SLCDC) COM3 selected
AT91C_SLCDC_COMSEL_4      EQU (0x4) ;- (SLCDC) COM4 selected
AT91C_SLCDC_COMSEL_5      EQU (0x5) ;- (SLCDC) COM5 selected
AT91C_SLCDC_COMSEL_6      EQU (0x6) ;- (SLCDC) COM6 selected
AT91C_SLCDC_COMSEL_7      EQU (0x7) ;- (SLCDC) COM7 selected
AT91C_SLCDC_COMSEL_8      EQU (0x8) ;- (SLCDC) COM8 selected
AT91C_SLCDC_COMSEL_9      EQU (0x9) ;- (SLCDC) COM9 selected
AT91C_SLCDC_SEGSEL        EQU (0x1F <<  8) ;- (SLCDC) Selection of the number of segment
AT91C_SLCDC_BUFTIME       EQU (0xF << 16) ;- (SLCDC) Buffer on time
AT91C_SLCDC_BUFTIME_0_percent EQU (0x0 << 16) ;- (SLCDC) Buffer aren't driven
AT91C_SLCDC_BUFTIME_2_Tsclk EQU (0x1 << 16) ;- (SLCDC) Buffer are driven during 2 SLCDC clock periods
AT91C_SLCDC_BUFTIME_4_Tsclk EQU (0x2 << 16) ;- (SLCDC) Buffer are driven during 4 SLCDC clock periods
AT91C_SLCDC_BUFTIME_8_Tsclk EQU (0x3 << 16) ;- (SLCDC) Buffer are driven during 8 SLCDC clock periods
AT91C_SLCDC_BUFTIME_16_Tsclk EQU (0x4 << 16) ;- (SLCDC) Buffer are driven during 16 SLCDC clock periods
AT91C_SLCDC_BUFTIME_32_Tsclk EQU (0x5 << 16) ;- (SLCDC) Buffer are driven during 32 SLCDC clock periods
AT91C_SLCDC_BUFTIME_64_Tsclk EQU (0x6 << 16) ;- (SLCDC) Buffer are driven during 64 SLCDC clock periods
AT91C_SLCDC_BUFTIME_128_Tsclk EQU (0x7 << 16) ;- (SLCDC) Buffer are driven during 128 SLCDC clock periods
AT91C_SLCDC_BUFTIME_50_percent EQU (0x8 << 16) ;- (SLCDC) Buffer are driven during 50 percent of the frame
AT91C_SLCDC_BUFTIME_100_percent EQU (0x9 << 16) ;- (SLCDC) Buffer are driven during 100 percent of the frame
AT91C_SLCDC_BIAS          EQU (0x3 << 20) ;- (SLCDC) Bias setting
AT91C_SLCDC_BIAS_1        EQU (0x0 << 20) ;- (SLCDC) Vbias is VDD 
AT91C_SLCDC_BIAS_1_2      EQU (0x1 << 20) ;- (SLCDC) Vbias is 1/2 VDD
AT91C_SLCDC_BIAS_1_3      EQU (0x2 << 20) ;- (SLCDC) Vbias is 1/3 VDD
AT91C_SLCDC_BIAS_1_4      EQU (0x3 << 20) ;- (SLCDC) Vbias is 1/4 VDD
AT91C_SLCDC_LPMODE        EQU (0x1 << 24) ;- (SLCDC) Low Power mode
/* - -------- SLCDC_FRR : (SLCDC Offset: 0x8) SLCDC Frame Rate Register -------- */
AT91C_SLCDC_PRESC         EQU (0x7 <<  0) ;- (SLCDC) Clock prescaler
AT91C_SLCDC_PRESC_SCLK_8  EQU (0x0) ;- (SLCDC) Clock Prescaler is 8
AT91C_SLCDC_PRESC_SCLK_16 EQU (0x1) ;- (SLCDC) Clock Prescaler is 16
AT91C_SLCDC_PRESC_SCLK_32 EQU (0x2) ;- (SLCDC) Clock Prescaler is 32
AT91C_SLCDC_PRESC_SCLK_64 EQU (0x3) ;- (SLCDC) Clock Prescaler is 64
AT91C_SLCDC_PRESC_SCLK_128 EQU (0x4) ;- (SLCDC) Clock Prescaler is 128
AT91C_SLCDC_PRESC_SCLK_256 EQU (0x5) ;- (SLCDC) Clock Prescaler is 256
AT91C_SLCDC_PRESC_SCLK_512 EQU (0x6) ;- (SLCDC) Clock Prescaler is 512
AT91C_SLCDC_PRESC_SCLK_1024 EQU (0x7) ;- (SLCDC) Clock Prescaler is 1024
AT91C_SLCDC_DIV           EQU (0x7 <<  8) ;- (SLCDC) Clock division
AT91C_SLCDC_DIV_1         EQU (0x0 <<  8) ;- (SLCDC) Clock division is 1
AT91C_SLCDC_DIV_2         EQU (0x1 <<  8) ;- (SLCDC) Clock division is 2
AT91C_SLCDC_DIV_3         EQU (0x2 <<  8) ;- (SLCDC) Clock division is 3
AT91C_SLCDC_DIV_4         EQU (0x3 <<  8) ;- (SLCDC) Clock division is 4
AT91C_SLCDC_DIV_5         EQU (0x4 <<  8) ;- (SLCDC) Clock division is 5
AT91C_SLCDC_DIV_6         EQU (0x5 <<  8) ;- (SLCDC) Clock division is 6
AT91C_SLCDC_DIV_7         EQU (0x6 <<  8) ;- (SLCDC) Clock division is 7
AT91C_SLCDC_DIV_8         EQU (0x7 <<  8) ;- (SLCDC) Clock division is 8
/* - -------- SLCDC_DR : (SLCDC Offset: 0xc) SLCDC Display Register -------- */
AT91C_SLCDC_DISPMODE      EQU (0x7 <<  0) ;- (SLCDC) Display mode
AT91C_SLCDC_DISPMODE_NORMAL EQU (0x0) ;- (SLCDC) Latched datas are displayed
AT91C_SLCDC_DISPMODE_FORCE_OFF EQU (0x1) ;- (SLCDC) All pixel are unvisible
AT91C_SLCDC_DISPMODE_FORCE_ON EQU (0x2) ;- (SLCDC) All pixel are visible
AT91C_SLCDC_DISPMODE_BLINK EQU (0x3) ;- (SLCDC) Turn all pixel alternatively off to the state defined in SCLD memory at LCDBLKFREQ frequency
AT91C_SLCDC_DISPMODE_INVERTED EQU (0x4) ;- (SLCDC) All pixel are set in the inverted state as defined in SCLD memory
AT91C_SLCDC_DISPMODE_INVERTED_BLINK EQU (0x5) ;- (SLCDC) Turn all pixel alternatively off to the opposite state defined in SCLD memory at LCDBLKFREQ frequency
/* - -------- SLCDC_SR : (SLCDC Offset: 0x10) SLCDC Status  Register -------- */
AT91C_SLCDC_ENA           EQU (0x1 <<  0) ;- (SLCDC) Enable status
/* - -------- SLCDC_IER : (SLCDC Offset: 0x20) SLCDC Interrupt Enable Register -------- */
AT91C_SLCDC_ENDFRAME      EQU (0x1 <<  0) ;- (SLCDC) End of Frame
AT91C_SLCDC_BKPER         EQU (0x1 <<  1) ;- (SLCDC) Blank Periode
AT91C_SLCDC_DIS           EQU (0x1 <<  2) ;- (SLCDC) Disable
/* - -------- SLCDC_IDR : (SLCDC Offset: 0x24) SLCDC Interrupt Disable Register -------- */
/* - -------- SLCDC_IMR : (SLCDC Offset: 0x28) SLCDC Interrupt Mask Register -------- */
/* - -------- SLCDC_ISR : (SLCDC Offset: 0x2c) SLCDC Interrupt Status Register -------- */

