una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam7l64.h
/* - ========== Register definition for PDC_US0 peripheral ========== */
AT91C_US0_TNPR            EQU (0xFFFC0118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_RNPR            EQU (0xFFFC0110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_TCR             EQU (0xFFFC010C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_PTCR            EQU (0xFFFC0120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_PTSR            EQU (0xFFFC0124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_TNCR            EQU (0xFFFC011C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_TPR             EQU (0xFFFC0108) ;- (PDC_US0) Transmit Pointer Register
AT91C_US0_RCR             EQU (0xFFFC0104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_RPR             EQU (0xFFFC0100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_RNCR            EQU (0xFFFC0114) ;- (PDC_US0) Receive Next Counter Register
/* - ========== Register definition for US0 peripheral ========== */
AT91C_US0_BRGR            EQU (0xFFFC0020) ;- (US0) Baud Rate Generator Register
AT91C_US0_NER             EQU (0xFFFC0044) ;- (US0) Nb Errors Register
AT91C_US0_CR              EQU (0xFFFC0000) ;- (US0) Control Register
AT91C_US0_IMR             EQU (0xFFFC0010) ;- (US0) Interrupt Mask Register
AT91C_US0_FIDI            EQU (0xFFFC0040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_TTGR            EQU (0xFFFC0028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_MR              EQU (0xFFFC0004) ;- (US0) Mode Register
AT91C_US0_RTOR            EQU (0xFFFC0024) ;- (US0) Receiver Time-out Register
AT91C_US0_CSR             EQU (0xFFFC0014) ;- (US0) Channel Status Register
AT91C_US0_RHR             EQU (0xFFFC0018) ;- (US0) Receiver Holding Register
AT91C_US0_IDR             EQU (0xFFFC000C) ;- (US0) Interrupt Disable Register
AT91C_US0_THR             EQU (0xFFFC001C) ;- (US0) Transmitter Holding Register
AT91C_US0_IF              EQU (0xFFFC004C) ;- (US0) IRDA_FILTER Register
AT91C_US0_IER             EQU (0xFFFC0008) ;- (US0) Interrupt Enable Register
/* - ========== Register definition for PDC_SSC peripheral ========== */
AT91C_SSC_TNCR            EQU (0xFFFD411C) ;- (PDC_SSC) Transmit Next Counter Register
AT91C_SSC_RPR             EQU (0xFFFD4100) ;- (PDC_SSC) Receive Pointer Register
AT91C_SSC_RNCR            EQU (0xFFFD4114) ;- (PDC_SSC) Receive Next Counter Register
AT91C_SSC_TPR             EQU (0xFFFD4108) ;- (PDC_SSC) Transmit Pointer Register
AT91C_SSC_PTCR            EQU (0xFFFD4120) ;- (PDC_SSC) PDC Transfer Control Register
AT91C_SSC_TCR             EQU (0xFFFD410C) ;- (PDC_SSC) Transmit Counter Register
AT91C_SSC_RCR             EQU (0xFFFD4104) ;- (PDC_SSC) Receive Counter Register
AT91C_SSC_RNPR            EQU (0xFFFD4110) ;- (PDC_SSC) Receive Next Pointer Register
AT91C_SSC_TNPR            EQU (0xFFFD4118) ;- (PDC_SSC) Transmit Next Pointer Register
AT91C_SSC_PTSR            EQU (0xFFFD4124) ;- (PDC_SSC) PDC Transfer Status Register
/* - ========== Register definition for SSC peripheral ========== */
AT91C_SSC_RHR             EQU (0xFFFD4020) ;- (SSC) Receive Holding Register
AT91C_SSC_RSHR            EQU (0xFFFD4030) ;- (SSC) Receive Sync Holding Register
AT91C_SSC_TFMR            EQU (0xFFFD401C) ;- (SSC) Transmit Frame Mode Register
AT91C_SSC_IDR             EQU (0xFFFD4048) ;- (SSC) Interrupt Disable Register
AT91C_SSC_THR             EQU (0xFFFD4024) ;- (SSC) Transmit Holding Register
AT91C_SSC_RCMR            EQU (0xFFFD4010) ;- (SSC) Receive Clock ModeRegister
AT91C_SSC_IER             EQU (0xFFFD4044) ;- (SSC) Interrupt Enable Register
AT91C_SSC_TSHR            EQU (0xFFFD4034) ;- (SSC) Transmit Sync Holding Register
AT91C_SSC_SR              EQU (0xFFFD4040) ;- (SSC) Status Register
AT91C_SSC_CMR             EQU (0xFFFD4004) ;- (SSC) Clock Mode Register
AT91C_SSC_TCMR            EQU (0xFFFD4018) ;- (SSC) Transmit Clock Mode Register
AT91C_SSC_CR              EQU (0xFFFD4000) ;- (SSC) Control Register
AT91C_SSC_IMR             EQU (0xFFFD404C) ;- (SSC) Interrupt Mask Register
AT91C_SSC_RFMR            EQU (0xFFFD4014) ;- (SSC) Receive Frame Mode Register
/* - ========== Register definition for PDC_TWI peripheral ========== */
AT91C_TWI_TNCR            EQU (0xFFFB811C) ;- (PDC_TWI) Transmit Next Counter Register
AT91C_TWI_RNCR            EQU (0xFFFB8114) ;- (PDC_TWI) Receive Next Counter Register
AT91C_TWI_TNPR            EQU (0xFFFB8118) ;- (PDC_TWI) Transmit Next Pointer Register
AT91C_TWI_PTCR            EQU (0xFFFB8120) ;- (PDC_TWI) PDC Transfer Control Register
AT91C_TWI_TCR             EQU (0xFFFB810C) ;- (PDC_TWI) Transmit Counter Register
AT91C_TWI_RPR             EQU (0xFFFB8100) ;- (PDC_TWI) Receive Pointer Register
AT91C_TWI_TPR             EQU (0xFFFB8108) ;- (PDC_TWI) Transmit Pointer Register
AT91C_TWI_RCR             EQU (0xFFFB8104) ;- (PDC_TWI) Receive Counter Register
AT91C_TWI_PTSR            EQU (0xFFFB8124) ;- (PDC_TWI) PDC Transfer Status Register
AT91C_TWI_RNPR            EQU (0xFFFB8110) ;- (PDC_TWI) Receive Next Pointer Register
/* - ========== Register definition for TWI peripheral ========== */
AT91C_TWI_IER             EQU (0xFFFB8024) ;- (TWI) Interrupt Enable Register
AT91C_TWI_CR              EQU (0xFFFB8000) ;- (TWI) Control Register
AT91C_TWI_SR              EQU (0xFFFB8020) ;- (TWI) Status Register
AT91C_TWI_IMR             EQU (0xFFFB802C) ;- (TWI) Interrupt Mask Register
AT91C_TWI_THR             EQU (0xFFFB8034) ;- (TWI) Transmit Holding Register
AT91C_TWI_IDR             EQU (0xFFFB8028) ;- (TWI) Interrupt Disable Register
AT91C_TWI_IADR            EQU (0xFFFB800C) ;- (TWI) Internal Address Register
AT91C_TWI_MMR             EQU (0xFFFB8004) ;- (TWI) Master Mode Register
AT91C_TWI_CWGR            EQU (0xFFFB8010) ;- (TWI) Clock Waveform Generator Register
AT91C_TWI_RHR             EQU (0xFFFB8030) ;- (TWI) Receive Holding Register
AT91C_TWI_SMR             EQU (0xFFFB8008) ;- (TWI) Slave Mode Register
/* - ========== Register definition for PWMC_CH3 peripheral ========== */
AT91C_CH3_CUPDR           EQU (0xFFFCC270) ;- (PWMC_CH3) Channel Update Register
AT91C_CH3_Reserved        EQU (0xFFFCC274) ;- (PWMC_CH3) Reserved
AT91C_CH3_CPRDR           EQU (0xFFFCC268) ;- (PWMC_CH3) Channel Period Register
AT91C_CH3_CDTYR           EQU (0xFFFCC264) ;- (PWMC_CH3) Channel Duty Cycle Register
AT91C_CH3_CCNTR           EQU (0xFFFCC26C) ;- (PWMC_CH3) Channel Counter Register
AT91C_CH3_CMR             EQU (0xFFFCC260) ;- (PWMC_CH3) Channel Mode Register
/* - ========== Register definition for PWMC_CH2 peripheral ========== */
AT91C_CH2_Reserved        EQU (0xFFFCC254) ;- (PWMC_CH2) Reserved
AT91C_CH2_CMR             EQU (0xFFFCC240) ;- (PWMC_CH2) Channel Mode Register
AT91C_CH2_CCNTR           EQU (0xFFFCC24C) ;- (PWMC_CH2) Channel Counter Register
AT91C_CH2_CPRDR           EQU (0xFFFCC248) ;- (PWMC_CH2) Channel Period Register
AT91C_CH2_CUPDR           EQU (0xFFFCC250) ;- (PWMC_CH2) Channel Update Register
AT91C_CH2_CDTYR           EQU (0xFFFCC244) ;- (PWMC_CH2) Channel Duty Cycle Register
/* - ========== Register definition for PWMC_CH1 peripheral ========== */
AT91C_CH1_Reserved        EQU (0xFFFCC234) ;- (PWMC_CH1) Reserved
AT91C_CH1_CUPDR           EQU (0xFFFCC230) ;- (PWMC_CH1) Channel Update Register
AT91C_CH1_CPRDR           EQU (0xFFFCC228) ;- (PWMC_CH1) Channel Period Register
AT91C_CH1_CCNTR           EQU (0xFFFCC22C) ;- (PWMC_CH1) Channel Counter Register
AT91C_CH1_CDTYR           EQU (0xFFFCC224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_CH1_CMR             EQU (0xFFFCC220) ;- (PWMC_CH1) Channel Mode Register
/* - ========== Register definition for PWMC_CH0 peripheral ========== */
AT91C_CH0_Reserved        EQU (0xFFFCC214) ;- (PWMC_CH0) Reserved
AT91C_CH0_CPRDR           EQU (0xFFFCC208) ;- (PWMC_CH0) Channel Period Register
AT91C_CH0_CDTYR           EQU (0xFFFCC204) ;- (PWMC_CH0) Channel Duty Cycle Register
AT91C_CH0_CMR             EQU (0xFFFCC200) ;- (PWMC_CH0) Channel Mode Register
AT91C_CH0_CUPDR           EQU (0xFFFCC210) ;- (PWMC_CH0) Channel Update Register
AT91C_CH0_CCNTR           EQU (0xFFFCC20C) ;- (PWMC_CH0) Channel Counter Register
/* - ========== Register definition for PWMC peripheral ========== */
AT91C_PWMC_IDR            EQU (0xFFFCC014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_DIS            EQU (0xFFFCC008) ;- (PWMC) PWMC Disable Register
AT91C_PWMC_IER            EQU (0xFFFCC010) ;- (PWMC) PWMC Interrupt Enable Register
AT91C_PWMC_VR             EQU (0xFFFCC0FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_ISR            EQU (0xFFFCC01C) ;- (PWMC) PWMC Interrupt Status Register
AT91C_PWMC_SR             EQU (0xFFFCC00C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_IMR            EQU (0xFFFCC018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_MR             EQU (0xFFFCC000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_ENA            EQU (0xFFFCC004) ;- (PWMC) PWMC Enable Register
/* - ========== Register definition for TC0 peripheral ========== */
AT91C_TC0_SR              EQU (0xFFFA0020) ;- (TC0) Status Register
AT91C_TC0_RC              EQU (0xFFFA001C) ;- (TC0) Register C
AT91C_TC0_RB              EQU (0xFFFA0018) ;- (TC0) Register B
AT91C_TC0_CCR             EQU (0xFFFA0000) ;- (TC0) Channel Control Register
AT91C_TC0_CMR             EQU (0xFFFA0004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_IER             EQU (0xFFFA0024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_RA              EQU (0xFFFA0014) ;- (TC0) Register A
AT91C_TC0_IDR             EQU (0xFFFA0028) ;- (TC0) Interrupt Disable Register
AT91C_TC0_CV              EQU (0xFFFA0010) ;- (TC0) Counter Value
AT91C_TC0_IMR             EQU (0xFFFA002C) ;- (TC0) Interrupt Mask Register
/* - ========== Register definition for TC1 peripheral ========== */
AT91C_TC1_RB              EQU (0xFFFA0058) ;- (TC1) Register B
AT91C_TC1_CCR             EQU (0xFFFA0040) ;- (TC1) Channel Control Register
AT91C_TC1_IER             EQU (0xFFFA0064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_IDR             EQU (0xFFFA0068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_SR              EQU (0xFFFA0060) ;- (TC1) Status Register
AT91C_TC1_CMR             EQU (0xFFFA0044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC1_RA              EQU (0xFFFA0054) ;- (TC1) Register A
AT91C_TC1_RC              EQU (0xFFFA005C) ;- (TC1) Register C
AT91C_TC1_IMR             EQU (0xFFFA006C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_CV              EQU (0xFFFA0050) ;- (TC1) Counter Value
/* - ========== Register definition for TC2 peripheral ========== */
AT91C_TC2_CMR             EQU (0xFFFA0084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC2_CCR             EQU (0xFFFA0080) ;- (TC2) Channel Control Register
AT91C_TC2_CV              EQU (0xFFFA0090) ;- (TC2) Counter Value
AT91C_TC2_RA              EQU (0xFFFA0094) ;- (TC2) Register A
AT91C_TC2_RB              EQU (0xFFFA0098) ;- (TC2) Register B
AT91C_TC2_IDR             EQU (0xFFFA00A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_IMR             EQU (0xFFFA00AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_RC              EQU (0xFFFA009C) ;- (TC2) Register C
AT91C_TC2_IER             EQU (0xFFFA00A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_SR              EQU (0xFFFA00A0) ;- (TC2) Status Register
/* - ========== Register definition for TCB peripheral ========== */
AT91C_TCB_BMR             EQU (0xFFFA00C4) ;- (TCB) TC Block Mode Register
AT91C_TCB_BCR             EQU (0xFFFA00C0) ;- (TCB) TC Block Control Register
/* - ========== Register definition for SLCDC peripheral ========== */
AT91C_SLCDC_FRR           EQU (0xFFFB0008) ;- (SLCDC) Frame Rate Register
AT91C_SLCDC_CR            EQU (0xFFFB0000) ;- (SLCDC) Control Register
AT91C_SLCDC_ISR           EQU (0xFFFB002C) ;- (SLCDC) Interrupt Status Register
AT91C_SLCDC_IER           EQU (0xFFFB0020) ;- (SLCDC) Interrupt Enable Register
AT91C_SLCDC_IDR           EQU (0xFFFB0024) ;- (SLCDC) Interrupt Disable Register
AT91C_SLCDC_DR            EQU (0xFFFB000C) ;- (SLCDC) Display Register
AT91C_SLCDC_IMR           EQU (0xFFFB0028) ;- (SLCDC) Interrupt Mask Register
AT91C_SLCDC_MR            EQU (0xFFFB0004) ;- (SLCDC) Mode Register
AT91C_SLCDC_MEM           EQU (0xFFFB0200) ;- (SLCDC) Memory Register
AT91C_SLCDC_SR            EQU (0xFFFB0010) ;- (SLCDC) Status Register
/* - ========== Register definition for PDC_ADC peripheral ========== */
AT91C_ADC_PTSR            EQU (0xFFFD8124) ;- (PDC_ADC) PDC Transfer Status Register
AT91C_ADC_PTCR            EQU (0xFFFD8120) ;- (PDC_ADC) PDC Transfer Control Register
AT91C_ADC_TNPR            EQU (0xFFFD8118) ;- (PDC_ADC) Transmit Next Pointer Register
AT91C_ADC_TNCR            EQU (0xFFFD811C) ;- (PDC_ADC) Transmit Next Counter Register
AT91C_ADC_RNPR            EQU (0xFFFD8110) ;- (PDC_ADC) Receive Next Pointer Register
AT91C_ADC_RNCR            EQU (0xFFFD8114) ;- (PDC_ADC) Receive Next Counter Register
AT91C_ADC_RPR             EQU (0xFFFD8100) ;- (PDC_ADC) Receive Pointer Register
AT91C_ADC_TCR             EQU (0xFFFD810C) ;- (PDC_ADC) Transmit Counter Register
AT91C_ADC_TPR             EQU (0xFFFD8108) ;- (PDC_ADC) Transmit Pointer Register
AT91C_ADC_RCR             EQU (0xFFFD8104) ;- (PDC_ADC) Receive Counter Register
/* - ========== Register definition for ADC peripheral ========== */
AT91C_ADC_CDR2            EQU (0xFFFD8038) ;- (ADC) ADC Channel Data Register 2
AT91C_ADC_CDR3            EQU (0xFFFD803C) ;- (ADC) ADC Channel Data Register 3
AT91C_ADC_CDR0            EQU (0xFFFD8030) ;- (ADC) ADC Channel Data Register 0
AT91C_ADC_CDR5            EQU (0xFFFD8044) ;- (ADC) ADC Channel Data Register 5
AT91C_ADC_CHDR            EQU (0xFFFD8014) ;- (ADC) ADC Channel Disable Register
AT91C_ADC_SR              EQU (0xFFFD801C) ;- (ADC) ADC Status Register
AT91C_ADC_CDR4            EQU (0xFFFD8040) ;- (ADC) ADC Channel Data Register 4
AT91C_ADC_CDR1            EQU (0xFFFD8034) ;- (ADC) ADC Channel Data Register 1
AT91C_ADC_LCDR            EQU (0xFFFD8020) ;- (ADC) ADC Last Converted Data Register
AT91C_ADC_IDR             EQU (0xFFFD8028) ;- (ADC) ADC Interrupt Disable Register
AT91C_ADC_CR              EQU (0xFFFD8000) ;- (ADC) ADC Control Register
AT91C_ADC_CDR7            EQU (0xFFFD804C) ;- (ADC) ADC Channel Data Register 7
AT91C_ADC_CDR6            EQU (0xFFFD8048) ;- (ADC) ADC Channel Data Register 6
AT91C_ADC_IER             EQU (0xFFFD8024) ;- (ADC) ADC Interrupt Enable Register
AT91C_ADC_CHER            EQU (0xFFFD8010) ;- (ADC) ADC Channel Enable Register
AT91C_ADC_CHSR            EQU (0xFFFD8018) ;- (ADC) ADC Channel Status Register
AT91C_ADC_MR              EQU (0xFFFD8004) ;- (ADC) ADC Mode Register
AT91C_ADC_IMR             EQU (0xFFFD802C) ;- (ADC) ADC Interrupt Mask Register

